Reports/ЛБ_ОтчетРасчетКассовыхЛимитов.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<Report>
		<Properties>
			<Name>ЛБ_ОтчетРасчетКассовыхЛимитов</Name>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>ДатаНач</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ДатаКон</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Организация</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Организации</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>РеквизитМакет</Name>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>РеквизитМакетЕкт</Name>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Отделение</Name>
					<Type>
						<v8:Type>v8:ValueListType</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Ломбард</Name>
					<Type>
						<v8:Type>v8:ValueListType</v8:Type>
					</Type>
				</Properties>
			</Attribute>
		</ChildObjects>
	</Report>
</MetaDataObject>

AccumulationRegisters/ЛБ_ДвиженияДенежныхСредств.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<AccumulationRegister>
		<Properties>
			<Name>ЛБ_ДвиженияДенежныхСредств</Name>
			<Comment>Денежные средства по назначению платежа</Comment>
			<RegisterType>Turnovers</RegisterType>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>Сумма</Name>
					<Comment>Сумма</Comment>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Attribute>
				<Properties>
					<Name>ВидОперации</Name>
					<Type>
						<v8:Type>cfg:EnumRef.ЛБ_ВидыОперацийПКО</v8:Type>
						<v8:Type>xs:string</v8:Type>
						<v8:Type>cfg:EnumRef.ЛБ_ВидыОперацийРКО</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>10</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Номер</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>20</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Дт</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>60</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Кт</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>60</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ФИО</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>250</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ДУЛ</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>500</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Основание</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>250</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Приложение</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>250</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ДополнительнаяИнформация</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>250</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>БанковскаяКарта</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ЛБ_КорпоративныеКарты</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Dimension>
				<Properties>
					<Name>Организация</Name>
					<Comment>Организация</Comment>
					<Type>
						<v8:Type>cfg:CatalogRef.Организации</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Ломбард</Name>
					<Comment>Ломбард</Comment>
					<Type>
						<v8:Type>cfg:CatalogRef.ЛБ_Ломбарды</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>ВидДенежныхСредств</Name>
					<Comment>Вид денежных средств</Comment>
					<Type>
						<v8:Type>cfg:EnumRef.ЛБ_ВидыДенежныхСредств</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>ВидДвиженияДС</Name>
					<Type>
						<v8:Type>cfg:EnumRef.ЛБ_ВидыДвиженияДС</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>КассоваяСмена</Name>
					<Type>
						<v8:Type>cfg:DocumentRef.ЛБ_ОперацииКассовойСмены</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>КассоваяОперация</Name>
					<Type>
						<v8:Type>cfg:DocumentRef.ЛБ_РасходныйКассовыйОрдер</v8:Type>
						<v8:Type>cfg:DocumentRef.ЛБ_ПриходныйКассовыйОрдер</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Контрагент</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ФизическиеЛица</v8:Type>
						<v8:Type>cfg:CatalogRef.ЛБ_Залогодатели</v8:Type>
						<v8:Type>cfg:CatalogRef.ЛБ_Ломбарды</v8:Type>
						<v8:Type>cfg:CatalogRef._ДемоКонтрагенты</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>ФизическоеЛицо</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ФизическиеЛица</v8:Type>
						<v8:Type>cfg:CatalogRef.ЛБ_Залогодатели</v8:Type>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</AccumulationRegister>
</MetaDataObject>

InformationRegisters/ЛБ_ПротоколРаботы.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<InformationRegister>
		<Properties>
			<Name>ЛБ_ПротоколРаботы</Name>
			<InformationRegisterPeriodicity>Nonperiodical</InformationRegisterPeriodicity>
			<WriteMode>Independent</WriteMode>
		</Properties>
		<ChildObjects>
			<Dimension>
				<Properties>
					<Name>Сотрудник</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ЛБ_Сотрудники</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Дата</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>DateTime</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Ломбард</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ЛБ_Ломбарды</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Действие</Name>
					<Type>
						<v8:Type>cfg:EnumRef.ЛБ_ДействияПользователя</v8:Type>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

InformationRegisters/ЛБ_РабочиеДниЛомбарда.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<InformationRegister>
		<Properties>
			<Name>ЛБ_РабочиеДниЛомбарда</Name>
			<InformationRegisterPeriodicity>Day</InformationRegisterPeriodicity>
			<WriteMode>Independent</WriteMode>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>Начало</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Time</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>Окончание</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Time</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ПерерывНачало</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Time</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ПерерывОкончание</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Time</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>РабочиеМинуты</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>4</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>Выходной</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ДеньНедели</Name>
					<Type>
						<v8:Type>cfg:EnumRef.ЛБ_ДниНедели</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>НомерДня</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>1</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Attribute>
				<Properties>
					<Name>Приказ</Name>
					<Type>
						<v8:Type>cfg:DocumentRef.ЛБ_ПриказРежимРаботы</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Dimension>
				<Properties>
					<Name>Ломбард</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ЛБ_Ломбарды</v8:Type>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

InformationRegisters/ЛБ_ОтделенияЛомбардов.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<InformationRegister>
		<Properties>
			<Name>ЛБ_ОтделенияЛомбардов</Name>
			<InformationRegisterPeriodicity>RecorderPosition</InformationRegisterPeriodicity>
			<WriteMode>RecorderSubordinate</WriteMode>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>Отделение</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ЛБ_ОтделенияЛомбардов</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>Центральный</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Dimension>
				<Properties>
					<Name>Ломбард</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ЛБ_Ломбарды</v8:Type>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

InformationRegisters/ЛБ_КассовыеЛимиты.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<InformationRegister>
		<Properties>
			<Name>ЛБ_КассовыеЛимиты</Name>
			<InformationRegisterPeriodicity>Day</InformationRegisterPeriodicity>
			<WriteMode>RecorderSubordinate</WriteMode>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>РассчетныйЛимит</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ФактическийЛимит</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Dimension>
				<Properties>
					<Name>Отделение</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ЛБ_ОтделенияЛомбардов</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Ломбард</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ЛБ_Ломбарды</v8:Type>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

Enums/ЛБ_ВидыДенежныхСредств.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<Enum>
		<Properties>
			<Name>ЛБ_ВидыДенежныхСредств</Name>
		</Properties>
		<ChildObjects>
			<EnumValue>
				<Properties>
					<Name>Наличные</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Безналичные</Name>
				</Properties>
			</EnumValue>
		</ChildObjects>
	</Enum>
</MetaDataObject>

Enums/ЛБ_ВидыОперацийРКО.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<Enum>
		<Properties>
			<Name>ЛБ_ВидыОперацийРКО</Name>
		</Properties>
		<ChildObjects>
			<EnumValue>
				<Properties>
					<Name>ВыдачаЗайма</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ВыдачаЗаймаПереоформление</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ВозвратПроцентов</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ВозвратПроцентовПоЗаявке</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ОтменаВыдачиЗайма</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ВозвратРазницыРеализацииНевостребованногоЗалога</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ПередачаВЦентральнуюКассу</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ПередачаВКассуЛомбарда</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ВыдачаДляСдачиНаРасчетныйСчет</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ВыдачаДляЗачисленияНаКорпоративнуюКарту</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Инкассация</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ВыдачаПодОтчет</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ВыплатаЗарплаты</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ВыплатаДепонированнойЗарплаты</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ОплатаКонтрагента</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Недостача</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>РасходныеОперацииПоСогласованиюСЦО</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ПрочиеРасходныеОперацииПоСогласованиюСЦО</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>СводныйРКО</Name>
				</Properties>
			</EnumValue>
		</ChildObjects>
	</Enum>
</MetaDataObject>

Enums/ЛБ_ДействияПользователя.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<Enum>
		<Properties>
			<Name>ЛБ_ДействияПользователя</Name>
		</Properties>
		<ChildObjects>
			<EnumValue>
				<Properties>
					<Name>Вход</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Выход</Name>
				</Properties>
			</EnumValue>
		</ChildObjects>
	</Enum>
</MetaDataObject>

Reports/ЛБ_ОтчетРасчетКассовыхЛимитов/Forms/ФормаОтчета/Ext/Form/Module.bsl
&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	Отчет.Организация = Справочники.Организации.НайтиПоКоду("ДМ-000003");
	Год = Год(ТекущаяДата());
	Отчет.ДатаНач = НачалоКвартала(ТекущаяДата());
	Отчет.ДатаКон = КонецКвартала(ТекущаяДата());
	
	УстановитьДатыОтчета(Истина);
	
КонецПроцедуры

&НаКлиенте
Процедура Интервал(Команда)
	ДиалогРедактирования = Новый ДиалогРедактированияСтандартногоПериода;
	
	Если ДиалогРедактирования.Редактировать() Тогда
		Отчет.ДатаНач	= ДиалогРедактирования.Период.ДатаНачала;
		Отчет.ДатаКон 	= ДиалогРедактирования.Период.ДатаОкончания;
	КонецЕсли;
КонецПроцедуры

&НаКлиенте
Процедура Сформировать(Команда)
	СформироватьНаСервере();
КонецПроцедуры

&НаСервере
Процедура СформироватьНаСервере()
	Результат.Очистить();  
	
	ДатаНач = Отчет.ДатаНач;
	ДатаКон = ?(Отчет.ДатаКон = Дата(1,1,1), КонецДня(ТекущаяДата()), КонецДня(Отчет.ДатаКон));
	
	Результат.ИмяПараметровПечати = "ПАРАМЕТРЫ_ПЕЧАТИ_РасчетЛимитов";
	
	//НеЕктИлиЦО = Отчет.Ломбард <> Справочники.ЛБ_Ломбарды.ЦентральныйОфис ИЛИ СтрНайти(Отчет.Отделение.Наименование, "Екатеринбург") = 0;
	ЕктИлиЦО = Отчет.Ломбард = Справочники.ЛБ_Ломбарды.ЦентральныйОфис
		ИЛИ Отчет.Отделение.НайтиПоЗначению(Справочники.ЛБ_ОтделенияЛомбардов.НайтиПоНаименованию("Екатеринбург")) <> Неопределено;
	
	Если НЕ ЕктИлиЦО Тогда
		Макет = Отчет.РеквизитМакет;
	Иначе
		Макет = Отчет.РеквизитМакетЕкт;
	КонецЕсли;
	
	ОбластьШапка = Макет.ПолучитьОбласть("Шапка");
	
	ПериодОтчета = "период с " + Формат(ДатаНач, "ДФ=dd.MM.yyyy") + " по " + Формат(ДатаКон, "ДФ=dd.MM.yyyy");
	
	ОбластьШапка.Параметры.Период = ПериодОтчета; 
	Результат.Вывести(ОбластьШапка);
	
	ОбластьЗаголовок = Макет.ПолучитьОбласть("Заголовок");
	Результат.Вывести(ОбластьЗаголовок);
	
	Запрос = Новый Запрос;
	Запрос.Текст = ПолучитьТекстЗапроса(ЕктИлиЦО);
	
	Запрос.УстановитьПараметр("ДатаНач", ДатаНач);
	Запрос.УстановитьПараметр("ДатаКон", ДатаКон);
	
	Если ЗначениеЗаполнено(Отчет.Ломбард) Тогда
		Запрос.УстановитьПараметр("Ломбард", Отчет.Ломбард);
	Иначе
		Запрос.УстановитьПараметр("Ломбард", ПолучитьСписокЛомбардов(ДатаКон, ?(ЗначениеЗаполнено(Отчет.Отделение), Отчет.Отделение.ВыгрузитьЗначения(), Неопределено)));
	КонецЕсли;
	
	Запрос.УстановитьПараметр("Организация", Отчет.Организация);
	
	РезультатЗапроса = Запрос.Выполнить().Выгрузить();
	
	Нпп = 0;
	Для каждого Стр Из РезультатЗапроса Цикл
		Если ПроверкаЧислаНаЧетность(Нпп) Тогда
			ОбластьСтрока = Макет.ПолучитьОбласть("СтрокаЧет");
		Иначе
			ОбластьСтрока = Макет.ПолучитьОбласть("СтрокаНечет");
		КонецЕсли;
		
		ЗаполнитьЗначенияСвойств(ОбластьСтрока.Параметры, Стр);
		Результат.Вывести(ОбластьСтрока);
		Нпп = Нпп + 1;
	КонецЦикла;
	
	ОбластьИтого = Макет.ПолучитьОбласть("Итого");
	ОбластьИтого.Параметры.ИтогоСуммаВыданныхЗаймов = РезультатЗапроса.Итог("СуммаВыданныхЗаймов");
	ОбластьИтого.Параметры.ИтогоРассчетныйЛимит = РезультатЗапроса.Итог("РассчетныйЛимит");
	
	Если НЕ ЕктИлиЦО Тогда
		ОбластьИтого.Параметры.ИтогоФактическийЛимит = РезультатЗапроса.Итог("ФактическийЛимит");
	Иначе
		ОбластьИтого.Параметры.ИтогоПроцентРасп = РезультатЗапроса.Итог("ПроцентРасп");
		ОбластьИтого.Параметры.ИтогоСуммаРасп = РезультатЗапроса.Итог("СуммаРасп");
		ОбластьИтого.Параметры.ИтогоЛимитОстатка = РезультатЗапроса.Итог("ЛимитОстатка");
	КонецЕсли;
	
	Результат.Вывести(ОбластьИтого);
	
КонецПроцедуры

&НаСервере
Функция ПолучитьТекстЗапроса(Ект = Ложь)
	Если Ект Тогда
		//Возврат "ВЫБРАТЬ
		//        |	ЛБ_ДвиженияДенежныхСредств.Ломбард КАК Ломбард,
		//        |	СУММА(ЛБ_ДвиженияДенежныхСредств.Сумма) КАК Сумма
		//        |ПОМЕСТИТЬ СуммаЗаймов
		//        |ИЗ
		//        |	РегистрНакопления.ЛБ_ДвиженияДенежныхСредств КАК ЛБ_ДвиженияДенежныхСредств
		//        |ГДЕ
		//        |	ЛБ_ДвиженияДенежныхСредств.Организация = &Организация
		//        |	И ЛБ_ДвиженияДенежныхСредств.Ломбард В(&Ломбард)
		//        |	И ЛБ_ДвиженияДенежныхСредств.Период МЕЖДУ &ДатаНач И &ДатаКон
		//        |	И ЛБ_ДвиженияДенежныхСредств.ВидДенежныхСредств = ЗНАЧЕНИЕ(Перечисление.ЛБ_ВидыДенежныхСредств.Наличные)
		//        |	И (ЛБ_ДвиженияДенежныхСредств.ВидОперации = ЗНАЧЕНИЕ(Перечисление.ЛБ_ВидыОперацийРКО.ВыдачаЗайма)
		//        |			ИЛИ ЛБ_ДвиженияДенежныхСредств.ВидОперации = ЗНАЧЕНИЕ(Перечисление.ЛБ_ВидыОперацийРКО.ВыдачаЗаймаПереоформление)
		//        |			ИЛИ ЛБ_ДвиженияДенежныхСредств.ВидОперации = ЗНАЧЕНИЕ(Перечисление.ЛБ_ВидыОперацийРКО.ОтменаВыдачиЗайма))
		//        |
		//        |СГРУППИРОВАТЬ ПО
		//        |	ЛБ_ДвиженияДенежныхСредств.Ломбард
		//        |;
		//        |
		//        |////////////////////////////////////////////////////////////////////////////////
		//        |ВЫБРАТЬ
		//        |	ЛБ_ДвиженияДенежныхСредств.Ломбард КАК Ломбард,
		//        |	КОЛИЧЕСТВО(ЛБ_ДвиженияДенежныхСредств.ВидОперации) КАК КоличествоДнейСнятий
		//        |ПОМЕСТИТЬ КолСнятий
		//        |ИЗ
		//        |	РегистрНакопления.ЛБ_ДвиженияДенежныхСредств КАК ЛБ_ДвиженияДенежныхСредств
		//        |ГДЕ
		//        |	ЛБ_ДвиженияДенежныхСредств.Организация = &Организация
		//        |	И ЛБ_ДвиженияДенежныхСредств.Ломбард В(&Ломбард)
		//        |	И ЛБ_ДвиженияДенежныхСредств.Период МЕЖДУ &ДатаНач И &ДатаКон
		//        |	И ЛБ_ДвиженияДенежныхСредств.ВидДенежныхСредств = ЗНАЧЕНИЕ(Перечисление.ЛБ_ВидыДенежныхСредств.Наличные)
		//        |	И ЛБ_ДвиженияДенежныхСредств.ВидОперации = ЗНАЧЕНИЕ(Перечисление.ЛБ_ВидыОперацийПКО.ПолучениеСКорпоративнойКарты)
		//        |
		//        |СГРУППИРОВАТЬ ПО
		//        |	ЛБ_ДвиженияДенежныхСредств.Ломбард
		//        |;
		//        |
		//        |////////////////////////////////////////////////////////////////////////////////
		//        |ВЫБРАТЬ
		//        |	ЛБ_РабочиеДниЛомбарда.Ломбард КАК Ломбард,
		//        |	СУММА(ВЫБОР
		//        |			КОГДА ЛБ_РабочиеДниЛомбарда.Выходной
		//        |				ТОГДА 0
		//        |			ИНАЧЕ 1
		//        |		КОНЕЦ) КАК КоличествоРабочихДней
		//        |ПОМЕСТИТЬ КолРабДней
		//        |ИЗ
		//        |	РегистрСведений.ЛБ_РабочиеДниЛомбарда КАК ЛБ_РабочиеДниЛомбарда
		//        |ГДЕ
		//        |	ЛБ_РабочиеДниЛомбарда.Ломбард В(&Ломбард)
		//        |	И ЛБ_РабочиеДниЛомбарда.Период МЕЖДУ &ДатаНач И &ДатаКон
		//        |
		//        |СГРУППИРОВАТЬ ПО
		//        |	ЛБ_РабочиеДниЛомбарда.Ломбард
		//        |;
		//        |
		//        |////////////////////////////////////////////////////////////////////////////////
		//        |ВЫБРАТЬ
		//        |	ЛБ_ОтделенияЛомбардовСрезПоследних.Ломбард КАК Ломбард,
		//        |	ЛБ_ОтделенияЛомбардовСрезПоследних.Отделение КАК Отделение
		//        |ПОМЕСТИТЬ Отделения
		//        |ИЗ
		//        |	РегистрСведений.ЛБ_ОтделенияЛомбардов.СрезПоследних(
		//        |			&ДатаКон,
		//        |			Отделение В
		//        |				(ВЫБРАТЬ
		//        |					ЛБ_ОтделенияЛомбардовСрезПоследних.Отделение КАК Отделение
		//        |				ИЗ
		//        |					РегистрСведений.ЛБ_ОтделенияЛомбардов.СрезПоследних(&ДатаКон, Ломбард В (&Ломбард)) КАК ЛБ_ОтделенияЛомбардовСрезПоследних)) КАК ЛБ_ОтделенияЛомбардовСрезПоследних
		//        |ГДЕ
		//        |	НЕ ЛБ_ОтделенияЛомбардовСрезПоследних.Ломбард.Закрыт
		//        |;
		//        |
		//        |////////////////////////////////////////////////////////////////////////////////
		//        |ВЫБРАТЬ
		//        |	ЛБ_КассовыеЛимитыСрезПоследних.Ломбард КАК Ломбард,
		//        |	ЛБ_КассовыеЛимитыСрезПоследних.ФактическийЛимит КАК ФактическийЛимит
		//        |ПОМЕСТИТЬ ФактЛимит
		//        |ИЗ
		//        |	РегистрСведений.ЛБ_КассовыеЛимиты.СрезПоследних(&ДатаКон, Ломбард В (&Ломбард)) КАК ЛБ_КассовыеЛимитыСрезПоследних
		//        |ГДЕ
		//        |	ЛБ_КассовыеЛимитыСрезПоследних.Период >= &ДатаКон
		//        |;
		//        |
		//        |////////////////////////////////////////////////////////////////////////////////
		//        |ВЫБРАТЬ
		//        |	Отделения.Отделение КАК Отделение,
		//        |	СуммаЗаймов.Ломбард КАК Ломбард,
		//        |	СуммаЗаймов.Ломбард.НомерЛомбарда КАК ЛомбардНомерЛомбарда,
		//        |	СуммаЗаймов.Сумма КАК СуммаВыданныхЗаймов,
		//        |	КолРабДней.КоличествоРабочихДней КАК КоличествоРабочихДней,
		//        |	КолСнятий.КоличествоДнейСнятий КАК КоличествоДнейСнятий,
		//        |	КолРабДней.КоличествоРабочихДней / КолСнятий.КоличествоДнейСнятий КАК ПериодМеждуДнямиПолученияСредств,
		//        |	ВЫРАЗИТЬ(СуммаЗаймов.Сумма / КолРабДней.КоличествоРабочихДней * КолРабДней.КоличествоРабочихДней / КолСнятий.КоличествоДнейСнятий КАК ЧИСЛО(15, 0)) КАК РассчетныйЛимит,
		//        |	ВЫБОР
		//        |		КОГДА ФактЛимит.ФактическийЛимит ЕСТЬ NULL
		//        |			ТОГДА 0
		//        |		ИНАЧЕ ФактЛимит.ФактическийЛимит
		//        |	КОНЕЦ КАК ФактическийЛимит
		//        |ПОМЕСТИТЬ Рассчеты
		//        |ИЗ
		//        |	СуммаЗаймов КАК СуммаЗаймов
		//        |		ЛЕВОЕ СОЕДИНЕНИЕ КолСнятий КАК КолСнятий
		//        |		ПО СуммаЗаймов.Ломбард = КолСнятий.Ломбард
		//        |		ЛЕВОЕ СОЕДИНЕНИЕ КолРабДней КАК КолРабДней
		//        |		ПО СуммаЗаймов.Ломбард = КолРабДней.Ломбард
		//        |		ЛЕВОЕ СОЕДИНЕНИЕ Отделения КАК Отделения
		//        |		ПО СуммаЗаймов.Ломбард = Отделения.Ломбард
		//        |		ЛЕВОЕ СОЕДИНЕНИЕ ФактЛимит КАК ФактЛимит
		//        |		ПО СуммаЗаймов.Ломбард = ФактЛимит.Ломбард
		//        |;
		//        |
		//        |////////////////////////////////////////////////////////////////////////////////
		//        |ВЫБРАТЬ
		//        |	СУММА(Рассчеты.РассчетныйЛимит) КАК СуммаРассчетныйЛимит
		//        |ПОМЕСТИТЬ СуммаРассчитанногоЛимита
		//        |ИЗ
		//        |	Рассчеты КАК Рассчеты
		//        |;
		//        |
		//        |////////////////////////////////////////////////////////////////////////////////
		//        |ВЫБРАТЬ
		//        |	ЛБ_КассовыеЛимитыСрезПоследних.ФактическийЛимит КАК ФактическийЛимит
		//        |ПОМЕСТИТЬ ЛимитЦО
		//        |ИЗ
		//        |	РегистрСведений.ЛБ_КассовыеЛимиты.СрезПоследних(&ДатаКон, Ломбард = ЗНАЧЕНИЕ(Справочник.ЛБ_Ломбарды.ЦентральныйОфис)) КАК ЛБ_КассовыеЛимитыСрезПоследних
		//        |;
		//        |
		//        |////////////////////////////////////////////////////////////////////////////////
		//        |ВЫБРАТЬ
		//        |	Рассчеты.ЛомбардНомерЛомбарда КАК НомерЛомбарда,
		//        |	Рассчеты.СуммаВыданныхЗаймов КАК СуммаВыданныхЗаймов,
		//        |	Рассчеты.КоличествоРабочихДней КАК КоличествоРабочихДней,
		//        |	Рассчеты.ПериодМеждуДнямиПолученияСредств КАК ПериодМеждуДнямиПолученияСредств,
		//        |	НАЧАЛОПЕРИОДА(&ДатаНач, ДЕНЬ) КАК ДатаНач,
		//        |	НАЧАЛОПЕРИОДА(&ДатаКон, ДЕНЬ) КАК ДатаКон,
		//        |	Рассчеты.РассчетныйЛимит КАК РассчетныйЛимит,
		//        |	ВЫРАЗИТЬ(Рассчеты.РассчетныйЛимит / СуммаРассчитанногоЛимита.СуммаРассчетныйЛимит * 100 КАК ЧИСЛО(6, 2)) КАК ПроцентРасп,
		//        |	ВЫРАЗИТЬ((ВЫРАЗИТЬ(Рассчеты.РассчетныйЛимит / СуммаРассчитанногоЛимита.СуммаРассчетныйЛимит * 100 КАК ЧИСЛО(6, 2))) * ЛимитЦО.ФактическийЛимит / 100 КАК ЧИСЛО(15, 2)) КАК СуммаРасп,
		//        |	Рассчеты.РассчетныйЛимит - (ВЫРАЗИТЬ((ВЫРАЗИТЬ(Рассчеты.РассчетныйЛимит / СуммаРассчитанногоЛимита.СуммаРассчетныйЛимит * 100 КАК ЧИСЛО(6, 2))) * ЛимитЦО.ФактическийЛимит / 100 КАК ЧИСЛО(15, 2))) КАК ЛимитОстатка
		//        |ИЗ
		//        |	Рассчеты КАК Рассчеты,
		//        |	СуммаРассчитанногоЛимита КАК СуммаРассчитанногоЛимита,
		//        |	ЛимитЦО КАК ЛимитЦО
		//        |
		//        |УПОРЯДОЧИТЬ ПО
		//        |	Рассчеты.Ломбард.Префикс";
		Возврат "ВЫБРАТЬ
		        |	ЛБ_ДвиженияДенежныхСредств.Ломбард КАК Ломбард,
		        |	СУММА(ЛБ_ДвиженияДенежныхСредств.Сумма) КАК Сумма
		        |ПОМЕСТИТЬ СуммаЗаймов
		        |ИЗ
		        |	РегистрНакопления.ЛБ_ДвиженияДенежныхСредств КАК ЛБ_ДвиженияДенежныхСредств
		        |ГДЕ
		        |	ЛБ_ДвиженияДенежныхСредств.Организация = &Организация
		        |	И ЛБ_ДвиженияДенежныхСредств.Ломбард В(&Ломбард)
		        |	И ЛБ_ДвиженияДенежныхСредств.Период МЕЖДУ &ДатаНач И &ДатаКон
		        |	И ЛБ_ДвиженияДенежныхСредств.ВидДенежныхСредств = ЗНАЧЕНИЕ(Перечисление.ЛБ_ВидыДенежныхСредств.Наличные)
		        |	И (ЛБ_ДвиженияДенежныхСредств.ВидОперации = ЗНАЧЕНИЕ(Перечисление.ЛБ_ВидыОперацийРКО.ВыдачаЗайма)
		        |			ИЛИ ЛБ_ДвиженияДенежныхСредств.ВидОперации = ЗНАЧЕНИЕ(Перечисление.ЛБ_ВидыОперацийРКО.ВыдачаЗаймаПереоформление)
		        |			ИЛИ ЛБ_ДвиженияДенежныхСредств.ВидОперации = ЗНАЧЕНИЕ(Перечисление.ЛБ_ВидыОперацийРКО.ОтменаВыдачиЗайма))
		        |
		        |СГРУППИРОВАТЬ ПО
		        |	ЛБ_ДвиженияДенежныхСредств.Ломбард
		        |;
		        |
		        |////////////////////////////////////////////////////////////////////////////////
		        |ВЫБРАТЬ
		        |	ЛБ_ДвиженияДенежныхСредств.Ломбард КАК Ломбард,
		        |	КОЛИЧЕСТВО(ЛБ_ДвиженияДенежныхСредств.ВидОперации) КАК КоличествоДнейСнятий
		        |ПОМЕСТИТЬ КолСнятий
		        |ИЗ
		        |	РегистрНакопления.ЛБ_ДвиженияДенежныхСредств КАК ЛБ_ДвиженияДенежныхСредств
		        |ГДЕ
		        |	ЛБ_ДвиженияДенежныхСредств.Организация = &Организация
		        |	И ЛБ_ДвиженияДенежныхСредств.Ломбард В(&Ломбард)
		        |	И ЛБ_ДвиженияДенежныхСредств.Период МЕЖДУ &ДатаНач И &ДатаКон
		        |	И ЛБ_ДвиженияДенежныхСредств.ВидДенежныхСредств = ЗНАЧЕНИЕ(Перечисление.ЛБ_ВидыДенежныхСредств.Наличные)
		        |	И ЛБ_ДвиженияДенежныхСредств.ВидОперации = ЗНАЧЕНИЕ(Перечисление.ЛБ_ВидыОперацийПКО.ПолучениеСКорпоративнойКарты)
		        |
		        |СГРУППИРОВАТЬ ПО
		        |	ЛБ_ДвиженияДенежныхСредств.Ломбард
		        |;
		        |
		        |////////////////////////////////////////////////////////////////////////////////
		        |ВЫБРАТЬ
		        |	ЛБ_ПротоколРаботы.Ломбард КАК Ломбард,
		        |	НАЧАЛОПЕРИОДА(ЛБ_ПротоколРаботы.Дата, ДЕНЬ) КАК Дата
		        |ПОМЕСТИТЬ ДниВхода
		        |ИЗ
		        |	РегистрСведений.ЛБ_ПротоколРаботы КАК ЛБ_ПротоколРаботы
		        |ГДЕ
		        |	ЛБ_ПротоколРаботы.Ломбард В(&Ломбард)
		        |	И ЛБ_ПротоколРаботы.Действие = ЗНАЧЕНИЕ(Перечисление.ЛБ_ДействияПользователя.Вход)
		        |	И ЛБ_ПротоколРаботы.Дата МЕЖДУ &ДатаНач И &ДатаКон
		        |
		        |СГРУППИРОВАТЬ ПО
		        |	ЛБ_ПротоколРаботы.Ломбард,
		        |	НАЧАЛОПЕРИОДА(ЛБ_ПротоколРаботы.Дата, ДЕНЬ)
		        |;
		        |
		        |////////////////////////////////////////////////////////////////////////////////
		        |ВЫБРАТЬ
		        |	ЛБ_РабочиеДниЛомбарда.Ломбард КАК Ломбард,
		        |	СУММА(ВЫБОР
		        |			КОГДА ЛБ_РабочиеДниЛомбарда.Выходной
		        |					ИЛИ ЛБ_РабочиеДниЛомбарда.Период <> ДниВхода.Дата
		        |				ТОГДА 0
		        |			КОГДА ЛБ_РабочиеДниЛомбарда.Период = ДниВхода.Дата
		        |				ТОГДА 1
		        |		КОНЕЦ) КАК КоличествоРабочихДней
		        |ПОМЕСТИТЬ КолРабДней
		        |ИЗ
		        |	РегистрСведений.ЛБ_РабочиеДниЛомбарда КАК ЛБ_РабочиеДниЛомбарда
		        |		ЛЕВОЕ СОЕДИНЕНИЕ ДниВхода КАК ДниВхода
		        |		ПО ЛБ_РабочиеДниЛомбарда.Ломбард = ДниВхода.Ломбард
		        |			И ЛБ_РабочиеДниЛомбарда.Период = ДниВхода.Дата
		        |ГДЕ
		        |	ЛБ_РабочиеДниЛомбарда.Ломбард В(&Ломбард)
		        |	И ЛБ_РабочиеДниЛомбарда.Период МЕЖДУ &ДатаНач И &ДатаКон
		        |
		        |СГРУППИРОВАТЬ ПО
		        |	ЛБ_РабочиеДниЛомбарда.Ломбард
		        |;
		        |
		        |////////////////////////////////////////////////////////////////////////////////
		        |ВЫБРАТЬ
		        |	ЛБ_ОтделенияЛомбардовСрезПоследних.Ломбард КАК Ломбард,
		        |	ЛБ_ОтделенияЛомбардовСрезПоследних.Отделение КАК Отделение
		        |ПОМЕСТИТЬ Отделения
		        |ИЗ
		        |	РегистрСведений.ЛБ_ОтделенияЛомбардов.СрезПоследних(
		        |			&ДатаКон,
		        |			Отделение В
		        |				(ВЫБРАТЬ
		        |					ЛБ_ОтделенияЛомбардовСрезПоследних.Отделение КАК Отделение
		        |				ИЗ
		        |					РегистрСведений.ЛБ_ОтделенияЛомбардов.СрезПоследних(&ДатаКон, Ломбард В (&Ломбард)) КАК ЛБ_ОтделенияЛомбардовСрезПоследних)) КАК ЛБ_ОтделенияЛомбардовСрезПоследних
		        |ГДЕ
		        |	НЕ ЛБ_ОтделенияЛомбардовСрезПоследних.Ломбард.Закрыт
		        |;
		        |
		        |////////////////////////////////////////////////////////////////////////////////
		        |ВЫБРАТЬ
		        |	ЛБ_КассовыеЛимитыСрезПоследних.Ломбард КАК Ломбард,
		        |	ЛБ_КассовыеЛимитыСрезПоследних.ФактическийЛимит КАК ФактическийЛимит
		        |ПОМЕСТИТЬ ФактЛимит
		        |ИЗ
		        |	РегистрСведений.ЛБ_КассовыеЛимиты.СрезПоследних(&ДатаКон, Ломбард В (&Ломбард)) КАК ЛБ_КассовыеЛимитыСрезПоследних
		        |ГДЕ
		        |	ЛБ_КассовыеЛимитыСрезПоследних.Период >= &ДатаКон
		        |;
		        |
		        |////////////////////////////////////////////////////////////////////////////////
		        |ВЫБРАТЬ
		        |	СуммаЗаймов.Ломбард КАК Ломбард,
		        |	СуммаЗаймов.Сумма КАК СуммаВыданныхЗаймов,
		        |	ВЫБОР
		        |		КОГДА (ВЫРАЗИТЬ(КолРабДней.КоличествоРабочихДней / КолСнятий.КоличествоДнейСнятий КАК ЧИСЛО(15, 0))) > 7
		        |			ТОГДА 7
		        |		ИНАЧЕ ВЫРАЗИТЬ(КолРабДней.КоличествоРабочихДней / КолСнятий.КоличествоДнейСнятий КАК ЧИСЛО(15, 0))
		        |	КОНЕЦ КАК ПериодМеждуДнямиПолученияСредств,
		        |	СуммаЗаймов.Сумма / КолРабДней.КоличествоРабочихДней КАК СуммаЗаймовНаКоличествоРабочихДней
		        |ПОМЕСТИТЬ ПромежуточныеРассчеты
		        |ИЗ
		        |	СуммаЗаймов КАК СуммаЗаймов
		        |		ЛЕВОЕ СОЕДИНЕНИЕ КолСнятий КАК КолСнятий
		        |		ПО СуммаЗаймов.Ломбард = КолСнятий.Ломбард
		        |		ЛЕВОЕ СОЕДИНЕНИЕ КолРабДней КАК КолРабДней
		        |		ПО СуммаЗаймов.Ломбард = КолРабДней.Ломбард
		        |;
		        |
		        |////////////////////////////////////////////////////////////////////////////////
		        |ВЫБРАТЬ
		        |	Отделения.Отделение КАК Отделение,
		        |	СуммаЗаймов.Ломбард КАК Ломбард,
		        |	СуммаЗаймов.Ломбард.НомерЛомбарда КАК ЛомбардНомерЛомбарда,
		        |	СуммаЗаймов.Сумма КАК СуммаВыданныхЗаймов,
		        |	КолРабДней.КоличествоРабочихДней КАК КоличествоРабочихДней,
		        |	КолСнятий.КоличествоДнейСнятий КАК КоличествоДнейСнятий,
		        |	ПромежуточныеРассчеты.ПериодМеждуДнямиПолученияСредств КАК ПериодМеждуДнямиПолученияСредств,
		        |	ВЫРАЗИТЬ(ПромежуточныеРассчеты.СуммаЗаймовНаКоличествоРабочихДней * ПромежуточныеРассчеты.ПериодМеждуДнямиПолученияСредств КАК ЧИСЛО(15, 2)) КАК РассчетныйЛимит,
		        |	ВЫБОР
		        |		КОГДА ФактЛимит.ФактическийЛимит ЕСТЬ NULL
		        |			ТОГДА 0
		        |		ИНАЧЕ ФактЛимит.ФактическийЛимит
		        |	КОНЕЦ КАК ФактическийЛимит
		        |ПОМЕСТИТЬ Рассчеты
		        |ИЗ
		        |	СуммаЗаймов КАК СуммаЗаймов
		        |		ЛЕВОЕ СОЕДИНЕНИЕ КолСнятий КАК КолСнятий
		        |		ПО СуммаЗаймов.Ломбард = КолСнятий.Ломбард
		        |		ЛЕВОЕ СОЕДИНЕНИЕ КолРабДней КАК КолРабДней
		        |		ПО СуммаЗаймов.Ломбард = КолРабДней.Ломбард
		        |		ЛЕВОЕ СОЕДИНЕНИЕ Отделения КАК Отделения
		        |		ПО СуммаЗаймов.Ломбард = Отделения.Ломбард
		        |		ЛЕВОЕ СОЕДИНЕНИЕ ФактЛимит КАК ФактЛимит
		        |		ПО СуммаЗаймов.Ломбард = ФактЛимит.Ломбард
		        |		ЛЕВОЕ СОЕДИНЕНИЕ ПромежуточныеРассчеты КАК ПромежуточныеРассчеты
		        |		ПО СуммаЗаймов.Ломбард = ПромежуточныеРассчеты.Ломбард
		        |;
		        |
		        |////////////////////////////////////////////////////////////////////////////////
		        |ВЫБРАТЬ
		        |	СУММА(Рассчеты.РассчетныйЛимит) КАК СуммаРассчетныйЛимит
		        |ПОМЕСТИТЬ СуммаРассчитанногоЛимита
		        |ИЗ
		        |	Рассчеты КАК Рассчеты
		        |;
		        |
		        |////////////////////////////////////////////////////////////////////////////////
		        |ВЫБРАТЬ
		        |	ЛБ_КассовыеЛимитыСрезПоследних.ФактическийЛимит КАК ФактическийЛимит
		        |ПОМЕСТИТЬ ЛимитЦО
		        |ИЗ
		        |	РегистрСведений.ЛБ_КассовыеЛимиты.СрезПоследних(&ДатаКон, Ломбард = ЗНАЧЕНИЕ(Справочник.ЛБ_Ломбарды.ЦентральныйОфис)) КАК ЛБ_КассовыеЛимитыСрезПоследних
		        |;
		        |
		        |////////////////////////////////////////////////////////////////////////////////
		        |ВЫБРАТЬ
		        |	Рассчеты.Отделение КАК Отделение,
		        |	Рассчеты.Ломбард КАК Ломбард,
		        |	Рассчеты.ЛомбардНомерЛомбарда КАК НомерЛомбарда,
		        |	Рассчеты.СуммаВыданныхЗаймов КАК СуммаВыданныхЗаймов,
		        |	Рассчеты.КоличествоРабочихДней КАК КоличествоРабочихДней,
		        |	Рассчеты.ПериодМеждуДнямиПолученияСредств КАК ПериодМеждуДнямиПолученияСредств,
		        |	НАЧАЛОПЕРИОДА(&ДатаНач, ДЕНЬ) КАК ДатаНач,
		        |	НАЧАЛОПЕРИОДА(&ДатаКон, ДЕНЬ) КАК ДатаКон,
		        |	Рассчеты.РассчетныйЛимит КАК РассчетныйЛимит,
		        |	ВЫРАЗИТЬ(Рассчеты.РассчетныйЛимит / СуммаРассчитанногоЛимита.СуммаРассчетныйЛимит * 100 КАК ЧИСЛО(6, 2)) КАК ПроцентРасп,
		        |	ВЫРАЗИТЬ((ВЫРАЗИТЬ(Рассчеты.РассчетныйЛимит / СуммаРассчитанногоЛимита.СуммаРассчетныйЛимит * 100 КАК ЧИСЛО(6, 2))) * ЛимитЦО.ФактическийЛимит / 100 КАК ЧИСЛО(15, 2)) КАК СуммаРасп,
		        |	Рассчеты.РассчетныйЛимит - (ВЫРАЗИТЬ((ВЫРАЗИТЬ(Рассчеты.РассчетныйЛимит / СуммаРассчитанногоЛимита.СуммаРассчетныйЛимит * 100 КАК ЧИСЛО(6, 2))) * ЛимитЦО.ФактическийЛимит / 100 КАК ЧИСЛО(15, 2))) КАК ЛимитОстатка
		        |ИЗ
		        |	Рассчеты КАК Рассчеты,
		        |	СуммаРассчитанногоЛимита КАК СуммаРассчитанногоЛимита,
		        |	ЛимитЦО КАК ЛимитЦО
		        |
		        |УПОРЯДОЧИТЬ ПО
		        |	Рассчеты.Ломбард.НомерЧисловой";
	Иначе 
		Возврат "ВЫБРАТЬ
		        |	ЛБ_ДвиженияДенежныхСредств.Ломбард КАК Ломбард,
		        |	СУММА(ЛБ_ДвиженияДенежныхСредств.Сумма) КАК Сумма
		        |ПОМЕСТИТЬ СуммаЗаймов
		        |ИЗ
		        |	РегистрНакопления.ЛБ_ДвиженияДенежныхСредств КАК ЛБ_ДвиженияДенежныхСредств
		        |ГДЕ
		        |	ЛБ_ДвиженияДенежныхСредств.Организация = &Организация
		        |	И ЛБ_ДвиженияДенежныхСредств.Ломбард В(&Ломбард)
		        |	И ЛБ_ДвиженияДенежныхСредств.Период МЕЖДУ &ДатаНач И &ДатаКон
		        |	И ЛБ_ДвиженияДенежныхСредств.ВидДенежныхСредств = ЗНАЧЕНИЕ(Перечисление.ЛБ_ВидыДенежныхСредств.Наличные)
		        |	И (ЛБ_ДвиженияДенежныхСредств.ВидОперации = ЗНАЧЕНИЕ(Перечисление.ЛБ_ВидыОперацийРКО.ВыдачаЗайма)
		        |			ИЛИ ЛБ_ДвиженияДенежныхСредств.ВидОперации = ЗНАЧЕНИЕ(Перечисление.ЛБ_ВидыОперацийРКО.ВыдачаЗаймаПереоформление)
		        |			ИЛИ ЛБ_ДвиженияДенежныхСредств.ВидОперации = ЗНАЧЕНИЕ(Перечисление.ЛБ_ВидыОперацийРКО.ОтменаВыдачиЗайма))
		        |
		        |СГРУППИРОВАТЬ ПО
		        |	ЛБ_ДвиженияДенежныхСредств.Ломбард
		        |;
		        |
		        |////////////////////////////////////////////////////////////////////////////////
		        |ВЫБРАТЬ
		        |	ЛБ_ДвиженияДенежныхСредств.Ломбард КАК Ломбард,
		        |	КОЛИЧЕСТВО(ЛБ_ДвиженияДенежныхСредств.ВидОперации) КАК КоличествоДнейСнятий
		        |ПОМЕСТИТЬ КолСнятий
		        |ИЗ
		        |	РегистрНакопления.ЛБ_ДвиженияДенежныхСредств КАК ЛБ_ДвиженияДенежныхСредств
		        |ГДЕ
		        |	ЛБ_ДвиженияДенежныхСредств.Организация = &Организация
		        |	И ЛБ_ДвиженияДенежныхСредств.Ломбард В(&Ломбард)
		        |	И ЛБ_ДвиженияДенежныхСредств.Период МЕЖДУ &ДатаНач И &ДатаКон
		        |	И ЛБ_ДвиженияДенежныхСредств.ВидДенежныхСредств = ЗНАЧЕНИЕ(Перечисление.ЛБ_ВидыДенежныхСредств.Наличные)
		        |	И ЛБ_ДвиженияДенежныхСредств.ВидОперации = ЗНАЧЕНИЕ(Перечисление.ЛБ_ВидыОперацийПКО.ПолучениеСКорпоративнойКарты)
		        |
		        |СГРУППИРОВАТЬ ПО
		        |	ЛБ_ДвиженияДенежныхСредств.Ломбард
		        |;
		        |
		        |////////////////////////////////////////////////////////////////////////////////
		        |ВЫБРАТЬ
		        |	ЛБ_ПротоколРаботы.Ломбард КАК Ломбард,
		        |	НАЧАЛОПЕРИОДА(ЛБ_ПротоколРаботы.Дата, ДЕНЬ) КАК Дата
		        |ПОМЕСТИТЬ ДниВхода
		        |ИЗ
		        |	РегистрСведений.ЛБ_ПротоколРаботы КАК ЛБ_ПротоколРаботы
		        |ГДЕ
		        |	ЛБ_ПротоколРаботы.Ломбард В(&Ломбард)
		        |	И ЛБ_ПротоколРаботы.Действие = ЗНАЧЕНИЕ(Перечисление.ЛБ_ДействияПользователя.Вход)
		        |	И ЛБ_ПротоколРаботы.Дата МЕЖДУ &ДатаНач И &ДатаКон
		        |
		        |СГРУППИРОВАТЬ ПО
		        |	ЛБ_ПротоколРаботы.Ломбард,
		        |	НАЧАЛОПЕРИОДА(ЛБ_ПротоколРаботы.Дата, ДЕНЬ)
		        |;
		        |
		        |////////////////////////////////////////////////////////////////////////////////
		        |ВЫБРАТЬ
		        |	ЛБ_РабочиеДниЛомбарда.Ломбард КАК Ломбард,
				//+МАН Поменять местами комментарий если потребуется тестирование
				//|	ВЫБОР
				//|		КОГДА СУММА(ВЫБОР
				//|					КОГДА ЛБ_РабочиеДниЛомбарда.Выходной
				//|							ИЛИ ЛБ_РабочиеДниЛомбарда.Период <> ДниВхода.Дата
				//|						ТОГДА 0
				//|					КОГДА ЛБ_РабочиеДниЛомбарда.Период = ДниВхода.Дата
				//|						ТОГДА 1
				//|				КОНЕЦ) = 0
				//|			ТОГДА 1
				//|		ИНАЧЕ СУММА(ВЫБОР
				//|					КОГДА ЛБ_РабочиеДниЛомбарда.Выходной
				//|							ИЛИ ЛБ_РабочиеДниЛомбарда.Период <> ДниВхода.Дата
				//|						ТОГДА 0
				//|					КОГДА ЛБ_РабочиеДниЛомбарда.Период = ДниВхода.Дата
				//|						ТОГДА 1
				//|				КОНЕЦ)
				//|	КОНЕЦ КАК КоличествоРабочихДней
		        |	СУММА(ВЫБОР
		        |			КОГДА ЛБ_РабочиеДниЛомбарда.Выходной
		        |					ИЛИ ЛБ_РабочиеДниЛомбарда.Период <> ДниВхода.Дата
		        |				ТОГДА 0
		        |			КОГДА ЛБ_РабочиеДниЛомбарда.Период = ДниВхода.Дата
		        |				ТОГДА 1
		        |			КОНЕЦ) КАК КоличествоРабочихДней
				//-МАН
		        |ПОМЕСТИТЬ КолРабДней
		        |ИЗ
		        |	РегистрСведений.ЛБ_РабочиеДниЛомбарда КАК ЛБ_РабочиеДниЛомбарда
		        |		ЛЕВОЕ СОЕДИНЕНИЕ ДниВхода КАК ДниВхода
		        |		ПО ЛБ_РабочиеДниЛомбарда.Ломбард = ДниВхода.Ломбард
		        |			И ЛБ_РабочиеДниЛомбарда.Период = ДниВхода.Дата
		        |ГДЕ
		        |	ЛБ_РабочиеДниЛомбарда.Ломбард В(&Ломбард)
		        |	И ЛБ_РабочиеДниЛомбарда.Период МЕЖДУ &ДатаНач И &ДатаКон
		        |
		        |СГРУППИРОВАТЬ ПО
		        |	ЛБ_РабочиеДниЛомбарда.Ломбард
		        |;
		        |
		        |////////////////////////////////////////////////////////////////////////////////
		        |ВЫБРАТЬ
		        |	ЛБ_ОтделенияЛомбардовСрезПоследних.Ломбард КАК Ломбард,
		        |	ЛБ_ОтделенияЛомбардовСрезПоследних.Отделение КАК Отделение
		        |ПОМЕСТИТЬ Отделения
		        |ИЗ
		        |	РегистрСведений.ЛБ_ОтделенияЛомбардов.СрезПоследних(
		        |			&ДатаКон,
		        |			Отделение В
		        |				(ВЫБРАТЬ
		        |					ЛБ_ОтделенияЛомбардовСрезПоследних.Отделение КАК Отделение
		        |				ИЗ
		        |					РегистрСведений.ЛБ_ОтделенияЛомбардов.СрезПоследних(&ДатаКон, Ломбард В (&Ломбард)) КАК ЛБ_ОтделенияЛомбардовСрезПоследних)) КАК ЛБ_ОтделенияЛомбардовСрезПоследних
		        |ГДЕ
		        |	НЕ ЛБ_ОтделенияЛомбардовСрезПоследних.Ломбард.Закрыт
		        |;
		        |
		        |////////////////////////////////////////////////////////////////////////////////
		        |ВЫБРАТЬ
		        |	ЛБ_КассовыеЛимитыСрезПоследних.Ломбард КАК Ломбард,
		        |	ЛБ_КассовыеЛимитыСрезПоследних.ФактическийЛимит КАК ФактическийЛимит
		        |ПОМЕСТИТЬ ФактЛимит
		        |ИЗ
		        |	РегистрСведений.ЛБ_КассовыеЛимиты.СрезПоследних(&ДатаКон, Ломбард В (&Ломбард)) КАК ЛБ_КассовыеЛимитыСрезПоследних
		        |ГДЕ
		        |	ЛБ_КассовыеЛимитыСрезПоследних.Период >= &ДатаКон
		        |;
		        |
		        |////////////////////////////////////////////////////////////////////////////////
		        |ВЫБРАТЬ
		        |	СуммаЗаймов.Ломбард КАК Ломбард,
		        |	СуммаЗаймов.Сумма КАК СуммаВыданныхЗаймов,
		        |	ВЫБОР
		        |		КОГДА (ВЫРАЗИТЬ(КолРабДней.КоличествоРабочихДней / КолСнятий.КоличествоДнейСнятий КАК ЧИСЛО(15, 0))) > 7
		        |			ТОГДА 7
		        |		ИНАЧЕ ВЫРАЗИТЬ(КолРабДней.КоличествоРабочихДней / КолСнятий.КоличествоДнейСнятий КАК ЧИСЛО(15, 0))
		        |	КОНЕЦ КАК ПериодМеждуДнямиПолученияСредств,
		        |	СуммаЗаймов.Сумма / КолРабДней.КоличествоРабочихДней КАК СуммаЗаймовНаКоличествоРабочихДней
		        |ПОМЕСТИТЬ ПромежуточныеРассчеты
		        |ИЗ
		        |	СуммаЗаймов КАК СуммаЗаймов
		        |		ЛЕВОЕ СОЕДИНЕНИЕ КолСнятий КАК КолСнятий
		        |		ПО СуммаЗаймов.Ломбард = КолСнятий.Ломбард
		        |		ЛЕВОЕ СОЕДИНЕНИЕ КолРабДней КАК КолРабДней
		        |		ПО СуммаЗаймов.Ломбард = КолРабДней.Ломбард
		        |;
		        |
		        |////////////////////////////////////////////////////////////////////////////////
		        |ВЫБРАТЬ
		        |	Отделения.Отделение КАК Отделение,
		        |	СуммаЗаймов.Ломбард КАК Ломбард,
		        |	СуммаЗаймов.Ломбард.НомерЛомбарда КАК НомерЛомбарда,
		        |	СуммаЗаймов.Сумма КАК СуммаВыданныхЗаймов,
		        |	КолРабДней.КоличествоРабочихДней КАК КоличествоРабочихДней,
		        |	КолСнятий.КоличествоДнейСнятий КАК КоличествоДнейСнятий,
		        |	ПромежуточныеРассчеты.ПериодМеждуДнямиПолученияСредств КАК ПериодМеждуДнямиПолученияСредств,
		        |	ВЫРАЗИТЬ(ПромежуточныеРассчеты.СуммаЗаймовНаКоличествоРабочихДней * ПромежуточныеРассчеты.ПериодМеждуДнямиПолученияСредств КАК ЧИСЛО(15, 2)) КАК РассчетныйЛимит,
		        |	ВЫБОР
		        |		КОГДА ФактЛимит.ФактическийЛимит ЕСТЬ NULL
		        |			ТОГДА 0
		        |		ИНАЧЕ ФактЛимит.ФактическийЛимит
		        |	КОНЕЦ КАК ФактическийЛимит
		        |ИЗ
		        |	СуммаЗаймов КАК СуммаЗаймов
		        |		ЛЕВОЕ СОЕДИНЕНИЕ КолСнятий КАК КолСнятий
		        |		ПО СуммаЗаймов.Ломбард = КолСнятий.Ломбард
		        |		ЛЕВОЕ СОЕДИНЕНИЕ КолРабДней КАК КолРабДней
		        |		ПО СуммаЗаймов.Ломбард = КолРабДней.Ломбард
		        |		ЛЕВОЕ СОЕДИНЕНИЕ Отделения КАК Отделения
		        |		ПО СуммаЗаймов.Ломбард = Отделения.Ломбард
		        |		ЛЕВОЕ СОЕДИНЕНИЕ ФактЛимит КАК ФактЛимит
		        |		ПО СуммаЗаймов.Ломбард = ФактЛимит.Ломбард
		        |		ЛЕВОЕ СОЕДИНЕНИЕ ПромежуточныеРассчеты КАК ПромежуточныеРассчеты
		        |		ПО СуммаЗаймов.Ломбард = ПромежуточныеРассчеты.Ломбард
		        |
		        |УПОРЯДОЧИТЬ ПО
		        |	Отделения.Отделение.Наименование,
		        |	СуммаЗаймов.Ломбард.НомерЧисловой";
	КонецЕсли;
КонецФункции

&НаСервереБезКонтекста
Функция ПолучитьСписокЛомбардов(Дата, Отделение)
	
	Условие = "";
	
	Если Отделение = Неопределено Тогда
		Условие = "НЕ Отделение.Наименование ПОДОБНО ""%Екатеринбург%""
			|				И НЕ Ломбард = ЗНАЧЕНИЕ(Справочник.ЛБ_Ломбарды.ЦентральныйОфис)";
	Иначе
		Условие = "Отделение В (&Отделение)";
	КонецЕсли;
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	ЛБ_ОтделенияЛомбардовСрезПоследних.Ломбард КАК Ломбард
		|ИЗ
		|	РегистрСведений.ЛБ_ОтделенияЛомбардов.СрезПоследних(
		|			&Дата,"
		+ Символы.ПС + Условие + Символы.ПС
		+ "				И НЕ Ломбард.Закрыт
		|				И НЕ Ломбард.ПометкаУдаления) КАК ЛБ_ОтделенияЛомбардовСрезПоследних
		//|ГДЕ
		//|	НЕ ЛБ_ОтделенияЛомбардовСрезПоследних.Ломбард.Закрыт
		|
		|УПОРЯДОЧИТЬ ПО
		|	ЛБ_ОтделенияЛомбардовСрезПоследних.Ломбард.НомерЧисловой";
	
	Запрос.УстановитьПараметр("Дата", Дата);
	Запрос.УстановитьПараметр("Отделение", Отделение);
	
	РезультатЗапроса = Запрос.Выполнить().Выбрать();
	
	СписокВозврата = Новый СписокЗначений;
	
	Пока РезультатЗапроса.Следующий() Цикл
		СписокВозврата.Добавить(РезультатЗапроса.Ломбард);
	КонецЦикла;
	
	Возврат СписокВозврата;
	
КонецФункции

&НаСервере
Функция ПроверкаЧислаНаЧетность(ВходящееЧисло) Экспорт
   РезультатВычисления = ВходящееЧисло%2 = 0; //Четное = Истина
   Возврат РезультатВычисления; //Возвращает Булево
КонецФункции

&НаКлиенте
Процедура ОтделениеНачалоВыбора(Элемент, ДанныеВыбора, ВыборДобавлением, СтандартнаяОбработка)
	СтандартнаяОбработка = Ложь;
	ОткрытьФормуВыбора(Элемент.Имя);
КонецПроцедуры

&НаКлиенте
Процедура ЛомбардНачалоВыбора(Элемент, ДанныеВыбора, ВыборДобавлением, СтандартнаяОбработка)
	СтандартнаяОбработка = Ложь;
	ОткрытьФормуВыбора(Элемент.Имя);
КонецПроцедуры

&НаКлиенте
Процедура ОткрытьФормуВыбора(Имя)
	ПараметрыФормы = новый структура;
	ПараметрыФормы.Вставить(Имя, Истина);
	ПараметрыФормы.Вставить("Дата", ?(Отчет.ДатаКон = Дата(1,1,1), КонецДня(ТекущаяДата()), КонецДня(Отчет.ДатаКон)));
	
	Если Имя = "Отделение" Тогда
		ПараметрыФормы.Вставить("Список", Отчет.Отделение);
	Иначе
		ПараметрыФормы.Вставить("Список", Отчет.Ломбард);
	КонецЕсли;
	
	ОповещениеПослеВыборка = Новый ОписаниеОповещения("ПослеВыбораЗначений", ЭтаФорма); 
	ОткрытьФорму("Отчет.ЛБ_ОтчетРасчетКассовыхЛимитов.Форма.ФормаВыбораЗначений", ПараметрыФормы, Этаформа,,,,ОповещениеПослеВыборка,РежимОткрытияОкнаФормы.БлокироватьОкноВладельца);
КонецПроцедуры

&НаКлиенте
Процедура ПослеВыбораЗначений(РезультатВыбора, ДопПараметры) Экспорт
	Если РезультатВыбора <> Неопределено И РезультатВыбора.Количество() > 0 Тогда
		
 		СсылкаЕкт = ПолучитьСсылкуОтделения("Екатеринбург");
		Отчет.Отделение.Очистить();
		Отчет.Ломбард.Очистить();
		
		Если ТипЗнч(РезультатВыбора[0]) = Тип("СправочникСсылка.ЛБ_ОтделенияЛомбардов") Тогда
			Для каждого Стр Из РезультатВыбора Цикл
				Если РезультатВыбора.Количество() > 1 И Стр = СсылкаЕкт Тогда
					Продолжить;
				Иначе
					Отчет.Отделение.Добавить(Стр);
				КонецЕсли;
			КонецЦикла;
			//Отчет.Отделение.ЗагрузитьЗначения(РезультатВыбора);
		Иначе
			ЕстьЦО = РезультатВыбора.Найти(ПредопределенноеЗначение("Справочник.ЛБ_Ломбарды.ЦентральныйОфис")) <> Неопределено;
			
			ДатаКон = ?(Отчет.ДатаКон = Дата(1,1,1), КонецДня(ТекущаяДата()), КонецДня(Отчет.ДатаКон));
			
			ТолькоЕкт = ПроверитьСписокВыбора(ДатаКон, РезультатВыбора, СсылкаЕкт);
			
			ЛомбардыЕкт = Новый Массив;
			
			Если НЕ ТолькоЕкт Тогда
				ЛомбардыЕкт = ПолучитьСписокЛомбардовЕкт(ДатаКон, СсылкаЕкт);
			КонецЕсли;
			
			Для каждого Стр Из РезультатВыбора Цикл
				Если НЕ ТолькоЕкт ИЛИ ЕстьЦО Тогда
					Если НЕ ТолькоЕкт Тогда
						НайденныеСтроки = ЛомбардыЕкт.Найти(Стр);
					КонецЕсли;
					
					Если НайденныеСтроки <> Неопределено ИЛИ Стр = ПредопределенноеЗначение("Справочник.ЛБ_Ломбарды.ЦентральныйОфис") Тогда
						Продолжить;
					Иначе
						Отчет.Ломбард.Добавить(Стр);
					КонецЕсли;
				Иначе
					Отчет.Ломбард.Добавить(Стр);
				КонецЕсли;
			КонецЦикла;
			//Отчет.Ломбард.ЗагрузитьЗначения(РезультатВыбора);
		КонецЕсли;
	КонецЕсли;
КонецПроцедуры

&НаСервере
Функция ПолучитьСсылкуОтделения(Текст)
	Возврат Справочники.ЛБ_ОтделенияЛомбардов.НайтиПоНаименованию(Текст)
КонецФункции

&НаСервереБезКонтекста
Функция ПроверитьСписокВыбора(Дата, ДанныеВыбора, ОтделениеЕкт)
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ РАЗЛИЧНЫЕ
		|	ЛБ_ОтделенияЛомбардовСрезПоследних.Отделение КАК Отделение
		|ИЗ
		|	РегистрСведений.ЛБ_ОтделенияЛомбардов.СрезПоследних(
		|			&Дата,
		|			Ломбард В (&Ломбард)
		|				И НЕ Ломбард.ПометкаУдаления) КАК ЛБ_ОтделенияЛомбардовСрезПоследних";
	
	Запрос.УстановитьПараметр("Дата", Дата);
	Запрос.УстановитьПараметр("Ломбард", ДанныеВыбора);
	
	РезультатЗапроса = Запрос.Выполнить().Выгрузить();
	
	Возврат РезультатЗапроса.Количество() = 1 И РезультатЗапроса.Найти(ОтделениеЕкт, "Отделение") <> Неопределено;
	
КонецФункции

&НаСервереБезКонтекста
Функция ПолучитьСписокЛомбардовЕкт(Дата, Отделение)
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	ЛБ_ОтделенияЛомбардовСрезПоследних.Ломбард КАК Ломбард
		|ИЗ
		|	РегистрСведений.ЛБ_ОтделенияЛомбардов.СрезПоследних(
		|			&Дата,
		|			Отделение В (&Отделение)
		|				И НЕ Ломбард.ПометкаУдаления) КАК ЛБ_ОтделенияЛомбардовСрезПоследних
		|
		|УПОРЯДОЧИТЬ ПО
		|	ЛБ_ОтделенияЛомбардовСрезПоследних.Ломбард.НомерЛомбарда";
	
	Запрос.УстановитьПараметр("Дата", Дата);
	Запрос.УстановитьПараметр("Отделение", Отделение);
	
	РезультатЗапроса = Запрос.Выполнить().Выгрузить();
	
	Возврат РезультатЗапроса.ВыгрузитьКолонку("Ломбард");
	
КонецФункции

&НаКлиенте
Процедура КварталПриИзменении(Элемент)
	УстановитьДатыОтчета();
КонецПроцедуры

&НаКлиенте
Процедура ГодПриИзменении(Элемент)
	УстановитьДатыОтчета();
КонецПроцедуры

&НаСервере
Процедура УстановитьДатыОтчета(ОткрытиеОтчета = Ложь)
	
	Если ОткрытиеОтчета Тогда
		Если Месяц(Отчет.ДатаНач) = 1 Тогда
			Квартал = 1;
		ИначеЕсли Месяц(Отчет.ДатаНач) = 4 Тогда
			Квартал = 2;
		ИначеЕсли Месяц(Отчет.ДатаНач) = 7 Тогда
			Квартал = 3;
		ИначеЕсли Месяц(Отчет.ДатаНач) = 10 Тогда
			Квартал = 4;
		КонецЕсли;
	Иначе
		Если Квартал = 1 Тогда
			ДатаКвартала = Дата(Год, 1, 1);
			Отчет.ДатаНач = НачалоКвартала(ДатаКвартала);
			Отчет.ДатаКон = КонецКвартала(ДатаКвартала);
		ИначеЕсли Квартал = 2 Тогда
			ДатаКвартала = Дата(Год, 4, 1);
			Отчет.ДатаНач = НачалоКвартала(ДатаКвартала);
			Отчет.ДатаКон = КонецКвартала(ДатаКвартала);
		ИначеЕсли Квартал = 3 Тогда
			ДатаКвартала = Дата(Год, 7, 1);
			Отчет.ДатаНач = НачалоКвартала(ДатаКвартала);
			Отчет.ДатаКон = КонецКвартала(ДатаКвартала);
		ИначеЕсли Квартал = 4 Тогда
			ДатаКвартала = Дата(Год, 10, 1);
			Отчет.ДатаНач = НачалоКвартала(ДатаКвартала);
			Отчет.ДатаКон = КонецКвартала(ДатаКвартала);
		КонецЕсли;
	КонецЕсли;

КонецПроцедуры
